import "./blessings.scss";
import { useState,useEffect } from "react";

import ImageBless from '../../components/imagebless.component/imagebless.component';
import VideoBless from "../../components/videobless.component/videobless.component";



function shuffleArray(array: any[]) {
    const shuffled = array.slice(); // Create a shallow copy to avoid mutating the original array
    for (let i = shuffled.length - 1; i > 0; i--) {
      const j = Math.floor(Math.random() * (i + 1));
      [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
    }
    return shuffled;
  }
  
  // Original pipeline array
  const images = [
    'צליל.jpg',
     'שלמה.jpg',
      'קרן.jpg',
      'דניאלה.jpg',
    '2003 - טיול לבית אלפא.JPG', '2003 - טיול לצפון.JPG', '2006 ים המלח פורים.JPG', '20250117_130654.jpg',
    '22.11.1993 חינה (1).jpg', '22.11.1993 חינה (2).jpg', '22.11.1993 חינה (3).jpg',
    '22.11.1993 חינה (4).jpg', '22.11.1993 חינה (5).jpg', '22.11.1993 חינה.jpg', '24.11.1993.jpg', 
    '24.11.93 (1).jpg', '24.11.93 (10).jpg', '24.11.93 (11).jpg', '24.11.93 (12).jpg', '24.11.93 (13).jpg', 
    '24.11.93 (14).jpg', '24.11.93 (15).jpg', '24.11.93 (16).jpg', '24.11.93 (17).jpg', '24.11.93 (18).jpg', 
    '24.11.93 (19).jpg', '24.11.93 (2).jpg', '24.11.93 (20).jpg', '24.11.93 (3).jpg', '24.11.93 (4).jpg', 
    '24.11.93 (5).jpg', '24.11.93 (6).jpg', '24.11.93 (7).jpg', '24.11.93 (8).jpg', '24.11.93 (9).jpg', 
    'IMG_1246.JPG', 'Joan Gahtan.jpg', 'Susan Raymond.jpg', 'אגם לוך נס סקוטלנד 2015.jpg', 'אוסטריה 2018 - יפה אוהבת רכבלים.jpg', 
    'אורית גחטן.jpg', 'איווט ושלי בן שימול.jpg', 'איזה טעים זה הולך להיות....jpg', 'איזה מהממת.jpg', 'איזה עמודי חשמל מוזרים יש בחול.jpg',
    'איטליה 2014.jpg', 'איטליה אגם גארדה 2004.JPG', 'איטליה דולומיטים 2004.JPG', 'איטליה ונציה 2004.JPG', 'איטליה פיזה 2014.jpg', 
    'איטליה פירנצה 2014.jpg', 'איטליה שינקווה טרה 2014.jpg', 'אינטרלאכן - שוויץ 2006.jpg', 'איציקידנה.jpg', 'אמי הגנרלית.jpg', 
    'אנגליה סקוטלנד 2015 (1).jpg', 'אנגליה סקוטלנד 2015 (2).jpg', 'אנגליה סקוטלנד 2015 (3).jpg', 'אנגליה סקוטלנד 2015.jpg', 
    'אנדורה 2017 (2).jpg', 'אנדורה 2017 (3).jpg', 'אנדורה 2017 (4).jpg', 'אנדורה 2017.jpg', 'אני חייבת לבשל את אלה.jpg', 
    "אסנת בז'רנו.jpg", 'אפרת קינן.jpg', 'אצל החברים אבי ורינת.jpg', 'אריאל גיא.jpg', 'אתי רחמקין (1).jpg', 'אתי רחמקין (2).jpg', 
    'אתי רחמקין (3).jpg', 'אתי רחמקין.jpg', 'בבית ברל.jpg', 'בבר ומשפחת בן זינו.jpg', 'בבריכה בצהלה עם דוד.jpg', 'בבריכה בצהלה.jpg', 
    'בברית מילה לתומר 1994 (1).jpg', 'בברית מילה לתומר 1994 (2).jpg', 'בברית מילה לתומר 1994 (3).jpg', 'בברית מילה לתומר 1994 (4).jpg', 
    'בברית מילה לתומר 1994 (5).jpg', 'בברית מילה לתומר 1994 (6).jpg', 'בגן הילדים (2).jpg', 'בגן הילדים.jpg', 'בחומה הסינית.jpg', 
    'בחתונה של נתי מינכן 2024.jpg', 'בטיול לגליל עם החברים אבי רינת ברק וקארון.jpg', 'ביפו עם החברים אבי רינת ברק וקארון.jpg', 
    'בית הספר כרמל בהונג קונג.jpg', 'בכותל 2017.jpg', 'במעונות בבית ברל.jpg', 'בנות הדוד מיכל ולילך ביתן.jpg', 'בר מצווה לשכן עומר.jpg', 
    'בר מצווה תומר עם מיכל ראש.jpg', 'ברכה ויוסי איינהורן.jpg', 'ברצלונה 2017.jpg', 'ברק פולק.jpg', 'גם לי מגיע לנוח 2021.jpg', 
    'גננת בהונג-קונג 1996-98.jpg', 'דוד ביטן.jpg', 'דניאל בן שושן.jpg', 'דרום איטליה 2023 (1).jpg', 'דרום איטליה 2023 (2).jpg', 
    'דרום איטליה 2023 (3).jpg', 'דרום איטליה 2023 (4).jpg', 'דרום איטליה 2023.jpg', 'האלשטאט אוסטריה 2018.jpg', 'הבת דוד לילך ביתן.jpg', 
    'הגננות מנתניה טסות לחול.jpg', 'הולנד 2001.JPG', 'הונג-קונג 1996-98 (1).jpg', 'הונג-קונג 1996-98 (2).jpg', 'הונג-קונג 1996-98 (3).jpg', 
    'הונג-קונג 1996-98 (4).jpg', 'הונג-קונג 1996-98 (5).jpg', 'הונג-קונג 1996-98 (6).jpg', 'הונג-קונג 1996-98 (7).jpg', 
    'הונג-קונג 1996-98 (8).jpg', 'הי-טקיסטית.jpg', 'המלאכיות של יפה - קרן צליל ודניאלה.jpg', 'הצגת מיץ פטל בגן של מאיה.jpg', 
    'השיט לקאפרי דרום איטליה 2023.jpg', 'השכנות חגית ואילנית.jpg', 'וואו טלוויזיה.jpg', 'זהו ננעלתי עליו 1991.jpg', 
    'טיול לירושלים המושלגת.jpg', 'טיול משפחתי לכרמל.jpg', 'טיול שנתי בתיכון (1).jpg', 'טיול שנתי בתיכון (2).jpg', 
    'טיול שנתי בתיכון (3).jpg', 'טיול שנתי בתיכון (4).jpg', 'טל (1).jpg', 'טל (2).jpg', 'טל בגן גורו 2003.jpg', 
    'טל יוני 2000.jpg', 'טל תינוקת מקסימה.jpg', 'טלטול שלי חיילת.jpg', 'יום הולדת לטל (2).jpg', 'יום הולדת לטל.jpg', 
    'יום הולדת לתומר בגן בהונג-קונג.jpg', 'יום הולדת שנה לתומר בהונג-קונג.jpg', 'יום הולדת.jpg', 'יוםא הולדת בבית ברל.jpg', 
    'ילדים לאכול לגמור את כל האוכל.jpg', 'ים המלח בפורים 2006.JPG', 'ים המלח בפורים.JPG', 'יפה הגננת המנגנת.jpg', 'יפה הסלב עם רינה פושקרנה.jpg', 
    'יפה והגננות קרן צליל ודניאלה.jpg', 'יפה ושלשת הדובים.jpg', 'ירח דבש בטורקיה 1994 (1).jpg', 'ירח דבש בטורקיה 1994 (2).jpg', 'ירח דבש בטורקיה 1994 (3).jpg', 
    'ירח דבש בטורקיה 1994 (4).jpg', 'ירח דבש בטורקיה 1994.jpg', 'ישראליות בהונג קונג 1996-98.JPG', 'כבר מאז עם הגיטרה.jpg', 'כוכבה ומשפחת קדמי.jpg', 
    'כולם להצטרף עם הכפיים.jpg', 'כיבוד אורחים.jpg', 'כל הכנופיה ביטן את ביתן.jpg', 'לונדון אנגליה 2015.jpg', ['ליאור ומשפחת כנפי 1.jpg', 'ליאור ומשפחת כנפי 2.jpg'], 
    'מאדאם טוסו לונדון 2015.jpg', 'מאיה יוני 1998.jpg', 'מאירינגן שוויץ - המפלים של שרלוק  הולמס 2006.jpg', 'מבקרים את אורית גיסתי במינכן 2024.jpg', 'מונטנגרו 2022 (1).jpg',
    'מונטנגרו 2022.jpg', 'מי יש לו ריבה כזאת ריבה יפה כל כך.jpg', 'מיכן בדרך להונג קונג 1995 (4).jpg', 'מינכן בדרך להונג קונג 1995 (7).jpg', 
    'מינכן בדרך להונג-קונג 1995 (1).jpg', 'מינכן בדרך להונג-קונג 1995 (2).jpg', 'מינכן בדרך להונג-קונג 1995 (3).jpg',
    'מינכן בדרך להונג-קונג 1995 (5).jpg', 'מינכן בדרך להונג-קונג 1995 (6).jpg', 'מרכידה את רינת אם החתן.jpg', 'משמר המלכה בסקוטלנד 2015.jpg', 
    'משפחת אזולאי.jpg', 'משפחת אפרגן.jpg', 'משפחת גראייק.jpg', ['משפחת דנציגר 1.jpg', 'משפחת דנציגר 2.jpg'], 'משפחת ראש.jpg', 'משפחת שטפל.jpg', 
    'משפחת שפיר.jpg', 'נורית גחטן.jpg', 'נחשו מי זו יפה.jpg', 'סבא אליעזר והגזר.jpg', 'סגראדה פאמיליה ברצלונה 2017.jpg', 'סטף 2002-3.JPG', 
    'סיגל השותפה לחדר בבית ברל.jpg', 'סין העיר האסורה.jpg', 'סין שנזן 1996.jpg', 'סקוטלנד 2015 - אגם לוך נס.jpg', 'סקוטלנד 2015.jpg', 
    'סקוטלנד אגם לוך נס 2015.jpg', 'סקוטלנד שייט לוויתנים 2015.jpg', "עם אבא ז'קוב (2).jpg", "עם אבא ז'קוב (3).jpg", "עם אבא ז'קוב.jpg", 
    'עם אורית גיסתי היקרה בטיול.jpg', 'עם איה אפרגן.jpg', 'עם אריאל גיא השכנה.jpg', 'עם בת הדוד איווט.jpg', 'עם הגיבה נורית בדירה הראשונה (אצל הפרסים).jpg', 
    'עם הגננות בנתניה.jpg', 'עם הדור הצעיר לבית גחטן.jpg', 'עם המורה לאנגלית אסטל.jpg', 'עם המשפחה של שלמה במינכן 2024.jpg', 'עם השכנות אילנית ואסנת.jpg', 
    "עם השכנות ג'ני ליאת וקרן.jpg", "עם השכנות ג'ני מיכל וליאת.jpg", 'עם השכנות שרונה וטני.jpg', 'עם חברים.jpg', 'עם חגית ימין השכנה.jpg', 'עם טל (עוד מעט 2000).jpg', 
    'עם טל ותומר.jpg', 'עם משפחת גחטן.jpg', 'עם נורית ובר.jpg', 'עם סיגל וקובי באשדוד.jpg', 'עם עדנה טלר וסוזן ריימונד חברות מימי הונג-קונג.jpg', 'עם עליזה עובדיה.jpg', 
    'עם ציפי שביט ואחרים בהונג קונג 1996-98.jpg', "עם קארון רינת וג'וני.jpg", 'עם קרן לוי הגננת בחול.jpg', 'עם קרן שפיר.jpg', 'עם רינה ענתי.jpg', 'עם שלמה 1992-93 (1).jpg', 
    'עם שלמה 1992-93 (2).jpg', 'עם שלמה 1992-93 (3).jpg', "עם תומר ואבא ז'קוב.jpg", 'עפ פנינה וכרמלה.jpg', 'פירנאים הצרפתים  2017.JPG', 'פלאכאו אוסטריה 2018.jpg', 
    'פנינה.jpg', 'פראג 2002 (1).JPG', 'פראג 2002 (2).JPG', 'פראג 2002 (3).JPG', 'צהל 1983-85 (1).jpg', 'צהל 1983-85 (2).jpg', 'צהל 1983-85 (3).jpg', 'צהל 1983-85 (4).jpg', 
    'צהל 1983-85 (5).jpg', 'צהל 1983-85 (6).jpg', 'צהל 1983-85 (7).jpg', 'צהל 1983-85 (8).jpg', 'ציריך - שוויץ 2006.jpg', 'קארון פולק.jpg', 'קניות באנדורה 2017.jpg', 
    'קניות בפריימרק אנגליה 2015.jpg', 'קניות מוצרי חשמל בגרמניה 2018.jpg', 'ראפטינג בפירינאים הצרפתים 2017.JPG', 'ראפטינג בפירנאים הצרפתים 2017 (2).JPG', 
    'רביעיית הגננות מנתניה.jpg', 'רודוס 2016 (1).jpg', 'רודוס 2016 (2).jpg', 'רודוס 2016 (3).jpg', 'רודוס 2016 (4).jpg', 'שיט לוויתנים 2015 סקוטלנד.jpg', 
    'שיקו ועדי אזולאי.jpg', 'שרונה ומשפחת מזור.jpg', 'תומא ובני הדודים.jpg', 'תומר (1).jpg', 'תומר (2).jpg', 'תומר (3).jpg', 'תומר (4).jpg', 'תומר (5).jpg', 
    'תומר (6).jpg', 'תומר (7).jpg', 'תומר הנחת תפילין בבית הכנסת.jpg', 'תומר והסבתא רבא אמה.jpg', 'תומר שלי ואיווט.jpg', 'תומר שלי ומושיק.jpg', 
    'תמיד גננת לא חשוב מי הילדים.jpg'
    ];
  const videos = [
    'איזה צחוק ווא עליא.mp4', 'אני אשתגע בביצוע מושלם.mp4', 'ברכה מחגית ימין (שכנה).mp4', 
    'ברכה עדנה טלר (חברה מימי הונג-קונג).mp4', 'ברכה צחי קדמי הגיס.mp4', 'ברכה של רינה חברת ילדות.mp4', 
    'גם את הברווזים מאכילה רודוס 2016.mp4', 'הגננת בקורונה 2020.mp4', 'הדוגמנית.mp4', 
    'יאללה תכסח אותו אולימפיאדה 2016.mp4', 
    'יפה כוכבת בידור אצל עדי אשכנזי.mp4', 
    'משמר המלכה סקוטלנד 2015.mp4', 
    'שיט לוויתנים סקוטלנד 2015.mp4', 
    'תאכל בן שלי תאכל.mp4'
    ]
  ;
    const merged_files = images.concat(videos);
  // Separate into groups
  const groups = merged_files.map(item => (Array.isArray(item) ? item : [item]));
  
  // Shuffle the groups
  const shuffledGroups = shuffleArray(groups);

  
  // Flatten the shuffled groups to reconstruct the pipeline

  
  




const Blessings = () => {

    const [index,setIndex] = useState(4);
    const [pipeline,setPipeline] = useState(shuffledGroups.slice(0, index));
    const handleScroll = () => {
        if (window.innerHeight + window.scrollY >= document.body.offsetHeight*0.99) {
            setIndex(prevIndex => {
                const newIndex = Math.min(prevIndex + 4, shuffledGroups.length);
                
                if (newIndex<=shuffledGroups.length)
                    setPipeline(shuffledGroups.slice(0, newIndex));
    
                return newIndex;
            });
        }
    };
    
    // things that i want to run only once
    useEffect(() => {
        

        window.addEventListener('scroll', handleScroll);
        return () => window.removeEventListener('scroll', handleScroll);
    }, []);

        return (
        <div className='blessings-page'>
            <h1 className="title-business-page">אימוש היקרה הכנתי לך אתר שתוכלי לראות את כל החוויות שצברת עד כה</h1>
            
            <ImageBless imageNames={[`mainimage.jpg`]} key={600}></ImageBless>
            {pipeline.map((item, i) =>{ 
                
                if (item[0].toLowerCase().includes('jpg') || item[0].includes('png') || item[0].includes('jpeg')) {
                    
                    
                    return (<ImageBless key={i} imageNames={item} />)
                }
                else {
                    return (<VideoBless key={i} videoNames={item} />)
                }
                }
            )}
        </div>
    );
}

export default Blessings;